earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Generic RP2040 (pico-debug)
# -----------------------------------
genericpicodebug.name=Generic RP2040 (pico-debug)
genericpicodebug.vid.0=0x1209
genericpicodebug.pid.0=0x2488
genericpicodebug.build.usbpid=-DSERIALUSB_PID=0xf00a
genericpicodebug.build.board=GENERIC_RP2040
genericpicodebug.build.mcu=cortex-m0plus
genericpicodebug.build.variant=generic
genericpicodebug.upload.tool=picodebug
genericpicodebug.upload.maximum_size=16777216
genericpicodebug.upload.maximum_data_size=245760
genericpicodebug.upload.wait_for_upload_port=true
genericpicodebug.upload.erase_cmd=
genericpicodebug.serial.disableDTR=false
genericpicodebug.serial.disableRTS=false
genericpicodebug.build.f_cpu=125000000
genericpicodebug.build.led=
genericpicodebug.build.core=rp2040
genericpicodebug.build.mcu=rp2040
genericpicodebug.build.ldscript=memmap_default.ld
genericpicodebug.build.ram_length=240k
genericpicodebug.build.boot2=boot2_generic_03h_4_padded_checksum
genericpicodebug.build.vid=0x2e8a
genericpicodebug.build.pid=0xf00a
genericpicodebug.build.usb_manufacturer="Generic"
genericpicodebug.build.usb_product="RP2040 (pico-debug)"
genericpicodebug.menu.flash.2097152_0=2MB (no FS)
genericpicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
genericpicodebug.menu.flash.2097152_0.build.flash_length=2093056
genericpicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
genericpicodebug.menu.flash.2097152_0.build.fs_start=270528512
genericpicodebug.menu.flash.2097152_0.build.fs_end=270528512
genericpicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
genericpicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
genericpicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
genericpicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
genericpicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
genericpicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
genericpicodebug.menu.flash.4194304_0=4MB (no FS)
genericpicodebug.menu.flash.4194304_0.upload.maximum_size=4190208
genericpicodebug.menu.flash.4194304_0.build.flash_length=4190208
genericpicodebug.menu.flash.4194304_0.build.eeprom_start=272625664
genericpicodebug.menu.flash.4194304_0.build.fs_start=272625664
genericpicodebug.menu.flash.4194304_0.build.fs_end=272625664
genericpicodebug.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
genericpicodebug.menu.flash.4194304_2097152.upload.maximum_size=2093056
genericpicodebug.menu.flash.4194304_2097152.build.flash_length=2093056
genericpicodebug.menu.flash.4194304_2097152.build.eeprom_start=272625664
genericpicodebug.menu.flash.4194304_2097152.build.fs_start=270528512
genericpicodebug.menu.flash.4194304_2097152.build.fs_end=272625664
genericpicodebug.menu.flash.8388608_0=8MB (no FS)
genericpicodebug.menu.flash.8388608_0.upload.maximum_size=8384512
genericpicodebug.menu.flash.8388608_0.build.flash_length=8384512
genericpicodebug.menu.flash.8388608_0.build.eeprom_start=276819968
genericpicodebug.menu.flash.8388608_0.build.fs_start=276819968
genericpicodebug.menu.flash.8388608_0.build.fs_end=276819968
genericpicodebug.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
genericpicodebug.menu.flash.8388608_4194304.upload.maximum_size=4190208
genericpicodebug.menu.flash.8388608_4194304.build.flash_length=4190208
genericpicodebug.menu.flash.8388608_4194304.build.eeprom_start=276819968
genericpicodebug.menu.flash.8388608_4194304.build.fs_start=272625664
genericpicodebug.menu.flash.8388608_4194304.build.fs_end=276819968
genericpicodebug.menu.flash.16777216_0=16MB (no FS)
genericpicodebug.menu.flash.16777216_0.upload.maximum_size=16773120
genericpicodebug.menu.flash.16777216_0.build.flash_length=16773120
genericpicodebug.menu.flash.16777216_0.build.eeprom_start=285208576
genericpicodebug.menu.flash.16777216_0.build.fs_start=285208576
genericpicodebug.menu.flash.16777216_0.build.fs_end=285208576
genericpicodebug.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
genericpicodebug.menu.flash.16777216_8388608.upload.maximum_size=8384512
genericpicodebug.menu.flash.16777216_8388608.build.flash_length=8384512
genericpicodebug.menu.flash.16777216_8388608.build.eeprom_start=285208576
genericpicodebug.menu.flash.16777216_8388608.build.fs_start=276819968
genericpicodebug.menu.flash.16777216_8388608.build.fs_end=285208576
genericpicodebug.menu.freq.125=125 MHz
genericpicodebug.menu.freq.125.build.f_cpu=125000000L
genericpicodebug.menu.freq.50=50 MHz
genericpicodebug.menu.freq.50.build.f_cpu=50000000L
genericpicodebug.menu.freq.100=100 MHz
genericpicodebug.menu.freq.100.build.f_cpu=100000000L
genericpicodebug.menu.freq.133=133 MHz
genericpicodebug.menu.freq.133.build.f_cpu=133000000L
genericpicodebug.menu.freq.150=150 MHz (Overclock)
genericpicodebug.menu.freq.150.build.f_cpu=150000000L
genericpicodebug.menu.freq.175=175 MHz (Overclock)
genericpicodebug.menu.freq.175.build.f_cpu=175000000L
genericpicodebug.menu.freq.200=200 MHz (Overclock)
genericpicodebug.menu.freq.200.build.f_cpu=200000000L
genericpicodebug.menu.freq.225=225 MHz (Overclock)
genericpicodebug.menu.freq.225.build.f_cpu=225000000L
genericpicodebug.menu.freq.250=250 MHz (Overclock)
genericpicodebug.menu.freq.250.build.f_cpu=250000000L
genericpicodebug.menu.freq.275=275 MHz (Overclock)
genericpicodebug.menu.freq.275.build.f_cpu=275000000L
genericpicodebug.menu.freq.300=300 MHz (Overclock)
genericpicodebug.menu.freq.300.build.f_cpu=300000000L
genericpicodebug.menu.dbgport.Disabled=Disabled
genericpicodebug.menu.dbgport.Disabled.build.debug_port=
genericpicodebug.menu.dbgport.Serial=Serial
genericpicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
genericpicodebug.menu.dbgport.Serial1=Serial1
genericpicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
genericpicodebug.menu.dbgport.Serial2=Serial2
genericpicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
genericpicodebug.menu.dbglvl.None=None
genericpicodebug.menu.dbglvl.None.build.debug_level=
genericpicodebug.menu.dbglvl.Core=Core
genericpicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
genericpicodebug.menu.dbglvl.SPI=SPI
genericpicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
genericpicodebug.menu.dbglvl.Wire=Wire
genericpicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
genericpicodebug.menu.dbglvl.All=All
genericpicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
genericpicodebug.menu.dbglvl.NDEBUG=NDEBUG
genericpicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
genericpicodebug.menu.usbstack.nousb=No USB
genericpicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
genericpicodebug.menu.boot2.boot2_generic_03h_2_padded_checksum=Generic SPI /2
genericpicodebug.menu.boot2.boot2_generic_03h_2_padded_checksum.build.boot2=boot2_generic_03h_2_padded_checksum
genericpicodebug.menu.boot2.boot2_generic_03h_4_padded_checksum=Generic SPI /4
genericpicodebug.menu.boot2.boot2_generic_03h_4_padded_checksum.build.boot2=boot2_generic_03h_4_padded_checksum
genericpicodebug.menu.boot2.boot2_is25lp080_2_padded_checksum=IS25LP080 QSPI /2
genericpicodebug.menu.boot2.boot2_is25lp080_2_padded_checksum.build.boot2=boot2_is25lp080_2_padded_checksum
genericpicodebug.menu.boot2.boot2_is25lp080_4_padded_checksum=IS25LP080 QSPI /4
genericpicodebug.menu.boot2.boot2_is25lp080_4_padded_checksum.build.boot2=boot2_is25lp080_4_padded_checksum
genericpicodebug.menu.boot2.boot2_w25q080_2_padded_checksum=W25Q080 QSPI /2
genericpicodebug.menu.boot2.boot2_w25q080_2_padded_checksum.build.boot2=boot2_w25q080_2_padded_checksum
genericpicodebug.menu.boot2.boot2_w25q080_4_padded_checksum=W25Q080 QSPI /4
genericpicodebug.menu.boot2.boot2_w25q080_4_padded_checksum.build.boot2=boot2_w25q080_4_padded_checksum
genericpicodebug.menu.boot2.boot2_w25x10cl_2_padded_checksum=W25X10CL QSPI /2
genericpicodebug.menu.boot2.boot2_w25x10cl_2_padded_checksum.build.boot2=boot2_w25x10cl_2_padded_checksum
genericpicodebug.menu.boot2.boot2_w25x10cl_4_padded_checksum=W25X10CL QSPI /4
genericpicodebug.menu.boot2.boot2_w25x10cl_4_padded_checksum.build.boot2=boot2_w25x10cl_4_padded_checksum

# -----------------------------------
# iLabs Challenger 2040 WiFi
# -----------------------------------
challenger_2040_wifi.name=iLabs Challenger 2040 WiFi
challenger_2040_wifi.vid.0=0x2e8a
challenger_2040_wifi.pid.0=0x1006
challenger_2040_wifi.build.usbpid=-DSERIALUSB_PID=0x1006
challenger_2040_wifi.build.board=CHALLENGER_2040_WIFI_RP2040
challenger_2040_wifi.build.mcu=cortex-m0plus
challenger_2040_wifi.build.variant=challenger_2040_wifi
challenger_2040_wifi.upload.tool=uf2conv
challenger_2040_wifi.upload.maximum_size=8388608
challenger_2040_wifi.upload.maximum_data_size=262144
challenger_2040_wifi.upload.wait_for_upload_port=true
challenger_2040_wifi.upload.erase_cmd=
challenger_2040_wifi.serial.disableDTR=false
challenger_2040_wifi.serial.disableRTS=false
challenger_2040_wifi.build.f_cpu=125000000
challenger_2040_wifi.build.led=
challenger_2040_wifi.build.core=rp2040
challenger_2040_wifi.build.mcu=rp2040
challenger_2040_wifi.build.ldscript=memmap_default.ld
challenger_2040_wifi.build.ram_length=256k
challenger_2040_wifi.build.boot2=boot2_w25q080_2_padded_checksum
challenger_2040_wifi.build.vid=0x2e8a
challenger_2040_wifi.build.pid=0x1006
challenger_2040_wifi.build.usb_manufacturer="iLabs"
challenger_2040_wifi.build.usb_product="Challenger 2040 WiFi"
challenger_2040_wifi.menu.flash.8388608_0=8MB (no FS)
challenger_2040_wifi.menu.flash.8388608_0.upload.maximum_size=8384512
challenger_2040_wifi.menu.flash.8388608_0.build.flash_length=8384512
challenger_2040_wifi.menu.flash.8388608_0.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_0.build.fs_start=276819968
challenger_2040_wifi.menu.flash.8388608_0.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
challenger_2040_wifi.menu.flash.8388608_65536.upload.maximum_size=8318976
challenger_2040_wifi.menu.flash.8388608_65536.build.flash_length=8318976
challenger_2040_wifi.menu.flash.8388608_65536.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_65536.build.fs_start=276754432
challenger_2040_wifi.menu.flash.8388608_65536.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
challenger_2040_wifi.menu.flash.8388608_131072.upload.maximum_size=8253440
challenger_2040_wifi.menu.flash.8388608_131072.build.flash_length=8253440
challenger_2040_wifi.menu.flash.8388608_131072.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_131072.build.fs_start=276688896
challenger_2040_wifi.menu.flash.8388608_131072.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
challenger_2040_wifi.menu.flash.8388608_262144.upload.maximum_size=8122368
challenger_2040_wifi.menu.flash.8388608_262144.build.flash_length=8122368
challenger_2040_wifi.menu.flash.8388608_262144.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_262144.build.fs_start=276557824
challenger_2040_wifi.menu.flash.8388608_262144.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
challenger_2040_wifi.menu.flash.8388608_524288.upload.maximum_size=7860224
challenger_2040_wifi.menu.flash.8388608_524288.build.flash_length=7860224
challenger_2040_wifi.menu.flash.8388608_524288.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_524288.build.fs_start=276295680
challenger_2040_wifi.menu.flash.8388608_524288.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
challenger_2040_wifi.menu.flash.8388608_1048576.upload.maximum_size=7335936
challenger_2040_wifi.menu.flash.8388608_1048576.build.flash_length=7335936
challenger_2040_wifi.menu.flash.8388608_1048576.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_1048576.build.fs_start=275771392
challenger_2040_wifi.menu.flash.8388608_1048576.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
challenger_2040_wifi.menu.flash.8388608_2097152.upload.maximum_size=6287360
challenger_2040_wifi.menu.flash.8388608_2097152.build.flash_length=6287360
challenger_2040_wifi.menu.flash.8388608_2097152.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_2097152.build.fs_start=274722816
challenger_2040_wifi.menu.flash.8388608_2097152.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
challenger_2040_wifi.menu.flash.8388608_3145728.upload.maximum_size=5238784
challenger_2040_wifi.menu.flash.8388608_3145728.build.flash_length=5238784
challenger_2040_wifi.menu.flash.8388608_3145728.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_3145728.build.fs_start=273674240
challenger_2040_wifi.menu.flash.8388608_3145728.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
challenger_2040_wifi.menu.flash.8388608_4194304.upload.maximum_size=4190208
challenger_2040_wifi.menu.flash.8388608_4194304.build.flash_length=4190208
challenger_2040_wifi.menu.flash.8388608_4194304.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_4194304.build.fs_start=272625664
challenger_2040_wifi.menu.flash.8388608_4194304.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
challenger_2040_wifi.menu.flash.8388608_5242880.upload.maximum_size=3141632
challenger_2040_wifi.menu.flash.8388608_5242880.build.flash_length=3141632
challenger_2040_wifi.menu.flash.8388608_5242880.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_5242880.build.fs_start=271577088
challenger_2040_wifi.menu.flash.8388608_5242880.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
challenger_2040_wifi.menu.flash.8388608_6291456.upload.maximum_size=2093056
challenger_2040_wifi.menu.flash.8388608_6291456.build.flash_length=2093056
challenger_2040_wifi.menu.flash.8388608_6291456.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_6291456.build.fs_start=270528512
challenger_2040_wifi.menu.flash.8388608_6291456.build.fs_end=276819968
challenger_2040_wifi.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
challenger_2040_wifi.menu.flash.8388608_7340032.upload.maximum_size=1044480
challenger_2040_wifi.menu.flash.8388608_7340032.build.flash_length=1044480
challenger_2040_wifi.menu.flash.8388608_7340032.build.eeprom_start=276819968
challenger_2040_wifi.menu.flash.8388608_7340032.build.fs_start=269479936
challenger_2040_wifi.menu.flash.8388608_7340032.build.fs_end=276819968
challenger_2040_wifi.menu.freq.125=125 MHz
challenger_2040_wifi.menu.freq.125.build.f_cpu=125000000L
challenger_2040_wifi.menu.freq.50=50 MHz
challenger_2040_wifi.menu.freq.50.build.f_cpu=50000000L
challenger_2040_wifi.menu.freq.100=100 MHz
challenger_2040_wifi.menu.freq.100.build.f_cpu=100000000L
challenger_2040_wifi.menu.freq.133=133 MHz
challenger_2040_wifi.menu.freq.133.build.f_cpu=133000000L
challenger_2040_wifi.menu.freq.150=150 MHz (Overclock)
challenger_2040_wifi.menu.freq.150.build.f_cpu=150000000L
challenger_2040_wifi.menu.freq.175=175 MHz (Overclock)
challenger_2040_wifi.menu.freq.175.build.f_cpu=175000000L
challenger_2040_wifi.menu.freq.200=200 MHz (Overclock)
challenger_2040_wifi.menu.freq.200.build.f_cpu=200000000L
challenger_2040_wifi.menu.freq.225=225 MHz (Overclock)
challenger_2040_wifi.menu.freq.225.build.f_cpu=225000000L
challenger_2040_wifi.menu.freq.250=250 MHz (Overclock)
challenger_2040_wifi.menu.freq.250.build.f_cpu=250000000L
challenger_2040_wifi.menu.freq.275=275 MHz (Overclock)
challenger_2040_wifi.menu.freq.275.build.f_cpu=275000000L
challenger_2040_wifi.menu.freq.300=300 MHz (Overclock)
challenger_2040_wifi.menu.freq.300.build.f_cpu=300000000L
challenger_2040_wifi.menu.dbgport.Disabled=Disabled
challenger_2040_wifi.menu.dbgport.Disabled.build.debug_port=
challenger_2040_wifi.menu.dbgport.Serial=Serial
challenger_2040_wifi.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
challenger_2040_wifi.menu.dbgport.Serial1=Serial1
challenger_2040_wifi.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
challenger_2040_wifi.menu.dbgport.Serial2=Serial2
challenger_2040_wifi.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
challenger_2040_wifi.menu.dbglvl.None=None
challenger_2040_wifi.menu.dbglvl.None.build.debug_level=
challenger_2040_wifi.menu.dbglvl.Core=Core
challenger_2040_wifi.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
challenger_2040_wifi.menu.dbglvl.SPI=SPI
challenger_2040_wifi.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
challenger_2040_wifi.menu.dbglvl.Wire=Wire
challenger_2040_wifi.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
challenger_2040_wifi.menu.dbglvl.All=All
challenger_2040_wifi.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
challenger_2040_wifi.menu.dbglvl.NDEBUG=NDEBUG
challenger_2040_wifi.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
challenger_2040_wifi.menu.usbstack.picosdk=Pico SDK
challenger_2040_wifi.menu.usbstack.picosdk.build.usbstack_flags="-I{runtime.platform.path}/tools/libpico"
challenger_2040_wifi.menu.usbstack.tinyusb=Adafruit TinyUSB
challenger_2040_wifi.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

